{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "slice_axis", 
      "name": "slice_nationality", 
      "attrs": {
        "axis": "-1", 
        "begin": "0", 
        "end": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape_nationality", 
      "attrs": {"shape": "(0,)"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nationalityembed_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embed_nationality", 
      "attrs": {
        "input_dim": "227", 
        "output_dim": "2"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat10", 
      "attrs": {
        "dim": "-1", 
        "num_args": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected20_weight", 
      "attrs": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected20_bias", 
      "attrs": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected20", 
      "attrs": {"num_hidden": "16"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims15", 
      "attrs": {"axis": "1"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hotel_features", 
      "attrs": {
        "axis": "-1", 
        "begin": "1", 
        "end": "None"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected21_weight", 
      "attrs": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected21_bias", 
      "attrs": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected21", 
      "attrs": {"num_hidden": "16"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims16", 
      "attrs": {"axis": "2"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot7", 
      "inputs": [[15, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(0, 0)"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected22_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected22_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected22", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "loss", 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    6, 
    7, 
    9, 
    10, 
    11, 
    12, 
    17, 
    18, 
    20, 
    21, 
    22, 
    23, 
    29, 
    30, 
    32
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38
  ], 
  "heads": [[33, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10301]}
}